"""
업기
잡기
4개
팀 2개
스페이스 ->
방향 선택

도 1
개 2
걸 3
윷 4
모 5

(2,0)   (1,4)   (1,3)   (1,2)   (1,1)   (1,0)


(2,1)   (-2,1)                 (-1,1)   (0,4)


(2,2)       (-2,2)         (-1,2)       (0,3)
                   (-1,3)
                   (-2,3)
(2,3)       (-1,4)         (-2,4)       (0,2)
#

(2,4)   (-1,5)                 (-2,5)   (0,1)

(3,0)   (3,1)   (3,2)   (3,3)   (3,4)   (0,0) (4,0)
"""


import PlayerClass
a = PlayerClass.player()
direction = ''
def take():
    if a.egg.x == 0 and a.egg.y == 0:
        print("대각선 : 1, 위 : 0 입력")
        input(direction)
        if direction == '1':


